# CreateMultiPlaneFilter Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointCloudFilterFactory..::..CreateMultiPlaneFilter Method
PointCloudFilterFactory Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreateMultiPlaneFilter(IList<(Of <<'(Plane>)>>)) | Creates a new point cloud filter based upon planar boundaries. |
| CreateMultiPlaneFilter(IList<(Of <<'(Plane>)>>), Int32) | Creates a new point cloud filter based upon planar boundaries. |

# See Also
PointCloudFilterFactory Class
PointCloudFilterFactory Members
Autodesk.Revit.DB.PointClouds Namespace